In [2]:
import pandas as pd
import numpy as np
import pymysql

In [3]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\biman\anaconda3\lib\site-packages (1.1.2)

In [4]:
import mysql.connector

conn=pymysql.connect(
    host="localhost",
    user='root',
    password="bimansql212006",
    database="msd"
)

query="""

SELECT * FROM ms_dhoni;

"""

df=pd.read_sql(query,conn)
df

C:\Users\BIMAN\AppData\Local\Temp\ipykernel_19228\3681110750.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df=pd.read_sql(query,conn)

,Index,Runs,Opposition,Ground,Date,Inns,Position,Dismissal,Match_ID,BF,4s,6s,SR,Match_Type
0,1,0,v Bangladesh,Chattogram,23-12-2004,1,7,Run Out,ODI # 2199,1,0,0,0.00,ODI
1,2,12,v Bangladesh,Dhaka,26-12-2004,2,7,Caught,ODI # 2201,11,2,0,109.09,ODI
2,3,7,v Bangladesh,Dhaka,27-12-2004,1,7,Not Out,ODI # 2202,2,0,1,350.00,ODI
3,4,3,v Pakistan,Kochi,02-04-2005,1,7,Caught,ODI # 2235,7,0,0,42.85,ODI
4,5,148,v Pakistan,Visakhapatnam,05-04-2005,1,3,Caught,ODI # 2236,123,15,4,120.32,ODI
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
521,607,28,v Afghanistan,Southampton,22-06-2019,1,5,Stumped,ODI # 4169,52,3,0,53.84,ODI
522,608,56,v West Indies,Manchester,27-06-2019,1,6,Not Out,ODI # 4175,61,3,2,91.80,ODI
523,609,42,v England,Birmingham,30-06-2019,2,6,Not Out,ODI # 4179,31,4,1,135.48,ODI
524,610,35,v Bangladesh,Birmingham,02-07-2019,1,6,Caught,ODI # 4182,33,4,0,106.06,ODI
525,612,50,v New Zealand,Manchester,09-07-2019,2,7,Run Out,ODI # 4190,72,1,1,69.44,ODI

## TOTAL NUMBER OF MATCH PLAYED BY MS DHONI

In [5]:
query="""
SELECT COUNT(Match_ID) AS total_match FROM ms_dhoni
WHERE BF IS NOT NULL
"""

total_match=pd.read_sql(query,conn)
display(total_match)

C:\Users\BIMAN\AppData\Local\Temp\ipykernel_19228\792019981.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  total_match=pd.read_sql(query,conn)

   total_match
0          526

## TOTAL RUNS SCORED BY MS  IN HIS INTERNATIONAL CAREER

In [6]:
query=""" 

SELECT SUM(Runs) AS Total_Runs FROM ms_dhoni;

"""
Total_Runs=pd.read_sql(query,conn)
display(Total_Runs)

C:\Users\BIMAN\AppData\Local\Temp\ipykernel_19228\3374395065.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Total_Runs=pd.read_sql(query,conn)

   Total_Runs
0     17266.0

## TOP 5 HIGHEST INDIVIDUAL SCORE OF MSD IN HIS CAREER

In [7]:
query=""" 
SELECT Runs AS Highest_Individual_Score FROM ms_dhoni
ORDER BY Runs DESC
LIMIT 5;


"""

Highest_Individual_Score=pd.read_sql(query,conn)
display(Highest_Individual_Score)

C:\Users\BIMAN\AppData\Local\Temp\ipykernel_19228\3518827712.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Highest_Individual_Score=pd.read_sql(query,conn)

   Highest_Individual_Score
0                       224
1                       183
2                       148
3                       148
4                       144

## MS DHONI INTERNATIONAL BATTING AVG

In [12]:
avg_runs_df = pd.read_sql(
    "SELECT AVG(Runs) AS Avg_Runs FROM ms_dhoni;",
    conn
)

print(avg_runs_df)

   Avg_Runs
0   32.8251

C:\Users\BIMAN\AppData\Local\Temp\ipykernel_19228\2685251326.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  avg_runs_df = pd.read_sql(

## TOTAL CENTURY AND HALF CENTURY OF MSD IN HIS INTERNATIONAL CAREER

In [25]:
query="""
SELECT
  SUM(CASE WHEN Runs>=100 THEN 1 ELSE 0 END) AS centuries,
  SUM(CASE WHEn Runs BETWEEN 50 AND 99 THEN 1 ELSE 0 END) AS Half_Centuries
FROM ms_dhoni;

"""

Total_Century_AND_Half_Centuries=pd.read_sql(query,conn)
display(Total_Century_AND_Half_Centuries)

C:\Users\BIMAN\AppData\Local\Temp\ipykernel_19228\2629383306.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Total_Century_AND_Half_Centuries=pd.read_sql(query,conn)

   centuries  Half_Centuries
0       16.0           108.0

## TOTAL NUMBER OF NOT OUT INNS

In [33]:
query="""  
SELECT COUNT(*) AS Total_Not_Out FROM ms_dhoni
WHERE Dismissal= "Not Out";

"""

Total_Not_Out=pd.read_sql(query,conn)
display(Total_Not_Out)

C:\Users\BIMAN\AppData\Local\Temp\ipykernel_19228\308111321.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Total_Not_Out=pd.read_sql(query,conn)

   Total_Not_Out
0            142

# YEAR WISE & TREND ANALYSIS

## TOTAL RUNS SCORED PER YEAR

In [46]:
query=""" 
SELECT YEAR(`Date`) AS year,
SUM(Runs) AS total_Runs
FROM ms_dhoni
GROUP BY year
ORDER BY year;

"""

Runs_Per_Year=pd.read_sql(query,conn)
display(Runs_Per_Year)

C:\Users\BIMAN\AppData\Local\Temp\ipykernel_19228\296665704.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Runs_Per_Year=pd.read_sql(query,conn)

   year  total_Runs
0  None     17266.0